{
  "id": 2,
  "title": "Dollywood's Harvest Festival Breaks Attendance Records with Over 50,000 Daily Visitors",
  "author": "Smoky Mountain Entertainment Weekly",
  "date": "June 10, 2025",
  "image": "https://images.unsplash.com/photo-1508061253366-f7da158b6d46?w=800",
  "excerpt": "The park's annual Harvest Festival has shattered previous attendance records, drawing visitors from across the nation to experience authentic Appalachian autumn traditions, craft demonstrations, and exclusive seasonal attractions.",
  "content": "<h3>Record-Breaking Success</h3><p>Dollywood's Harvest Festival has achieved unprecedented success this season, with daily attendance consistently exceeding 50,000 visitors throughout the event's run. This represents a 35% increase over last year's numbers and establishes new benchmarks for seasonal events at the Tennessee theme park.</p><h3>Authentic Appalachian Experiences</h3><p>The festival's success can be attributed to its authentic celebration of Appalachian harvest traditions. Visitors have been captivated by live demonstrations of traditional crafts including blacksmithing, pottery making, and quilting. The festival also features authentic mountain music performances on multiple stages throughout the park, showcasing both established artists and emerging talent from the region.</p><h3>Culinary Delights</h3><p>Food has been a major draw, with festival-exclusive offerings including traditional Appalachian dishes prepared using family recipes passed down through generations. The popular \"Harvest Kitchen\" area features cooking demonstrations where visitors can learn to prepare regional specialties like stack cake, cornbread, and various preserves using traditional methods.</p><h3>Economic Impact</h3><p>The festival's success has generated significant economic benefits for the broader Sevier County region. Local hotels report 95% occupancy rates during festival weekends, and area restaurants and shops have seen substantial increases in business. The event has also provided employment opportunities for over 200 local artisans and performers.</p>"
}