{
  "id": 3,
  "title": "Dolly Parton Surprises Guests with Impromptu Performance at Dollywood's Chapel",
  "author": "Kolby Johnson",
  "date": "June 5, 2025",
  "image": "https://images.unsplash.com/photo-1493225457124-a3eb161ffa5f?w=800",
  "excerpt": "In a heartwarming surprise that left guests in tears of joy, Dolly Parton made an unannounced appearance at the park's chapel, performing several of her classic songs for a small group of visitors celebrating a special anniversary.",
  "content": "<h3>An Unforgettable Surprise</h3><p>What began as a quiet afternoon at Dollywood's chapel turned into a magical moment that guests will treasure forever. Dolly Parton, known for her spontaneous acts of kindness, surprised a couple celebrating their 50th wedding anniversary with an intimate performance that included \"I Will Always Love You\" and \"Coat of Many Colors.\"</p><h3>The Golden Anniversary Celebration</h3><p>Harold and Martha Jenkins from Kentucky had chosen to celebrate their golden anniversary at Dollywood, having been fans of Dolly Parton since their early dating days. Word of their celebration reached park staff, who discreetly contacted Dolly's team. The country music legend, who happened to be visiting the park that day, immediately offered to make their celebration extra special.</p><h3>A Moment of Pure Magic</h3><p>The impromptu concert drew a small crowd of about 30 guests who happened to be in the chapel area. Dolly performed acoustically, accompanied only by her guitar, creating an intimate atmosphere that many described as \"spiritual\" and \"life-changing.\" Several guests captured video of the performance, which has since gone viral on social media.</p><h3>Continuing a Legacy of Kindness</h3><p>This surprise performance continues Dolly Parton's long tradition of unexpected acts of generosity at her theme park. Over the years, she has surprised countless guests with impromptu appearances, personal conversations, and memorable photo opportunities. These spontaneous moments have become part of Dollywood's legend and contribute to its reputation as more than just a theme park, but a place where dreams come true.</p>"
}