{
  "id": 42,
  "title": "Dollywood Reveals Harvest Festival Concert Lineup Featuring 140 Artists Across Six Weeks",
  "author": "Kolby Johnson",
  "date": "August 23, 2025",
  "image": "/images/42.webp",
  "excerpt": "The Harvest Festival entertainment lineup features more than 700 live performances from over 140 artists spanning Southern gospel, bluegrass, country, and Americana, with headliners including Triumphant Quartet, Rhonda Vincent & The Rage, and Dailey & Vincent.",
  "content": "<h3>Extensive Entertainment Lineup Announced</h3><p>Dollywood has revealed the complete entertainment lineup for the Harvest Festival, featuring more than 700 live performances across the six-week festival from September 12 through October 27. The festival showcases a diverse range of sounds, styles, genres, and instrumentations with live performances from more than 140 artists, making it a music lover's paradise with all concerts included with park admission.</p><h3>Featured Headliners and Schedule</h3><p>Major headline acts include Triumphant Quartet performing September 15-19, Rhonda Vincent & The Rage appearing October 5-7 and October 13-14, and Dailey & Vincent closing out the festival October 15-19. The lineup blends beloved returning artists with fresh new acts across multiple musical genres, providing variety throughout the festival's six-week run.</p><h3>Gospel and Country Artists</h3><p>The gospel lineup includes The Isaacs, The Inspirations, Jeff and Sheri Easter, 11th Hour, The Down East Boys, LeFevre Quartet, Legacy Five, and Emmanuel Quartet. Country performers feature Grand Ole Opry member Mandy Barnett, Grammy-nominated singer-songwriter Lee Roy Parnell, and legendary country artist T.G., representing both established and emerging talent in the genre.</p><h3>Bluegrass and International Acts</h3><p>Bluegrass artists include Special Consensus, Alison Brown and Authentic Unlimited, along with bands such as Williamson Branch, The Baker Family, and Kenny and Amanda Smith. International performers bring global flavor with Ireland's JigJam and New Zealand's queen of country Tami Neilson, while Atlantic Canada contributes New Brunswick bluegrass group New Harmony, teen fiddlers The Lumber Jills, Acadian dance band Beauxmont, and Prince Edward Island's Inn Echo.</p><h3>Value and Accessibility</h3><p>All Harvest Festival concerts are included with park admission, providing exceptional value for music enthusiasts who can experience hundreds of performances without additional fees. This inclusive approach allows families to enjoy diverse musical genres and discover new artists while experiencing the festival's other attractions, including Great Pumpkin LumiNights and the new Candy Corn Country area.</p>"
}