{
  "id": 5,
  "title": "Dollywood's New 'Southern Hospitality' Hotel Opens to Rave Reviews",
  "author": "Kolby Johnson",
  "date": "May 20, 2025",
  "image": "https://images.unsplash.com/photo-1566073771259-6a8506099945?w=800",
  "excerpt": "The park's first on-site luxury resort has opened its doors, featuring authentic Appalachian design, world-class amenities, and exclusive park access that's earning praise from travel critics and guests alike.",
  "content": "<h3>A Dream Realized</h3><p>After years of planning and construction, Dollywood's Southern Hospitality Resort has officially opened, offering guests an unprecedented luxury experience that captures the essence of Appalachian culture and hospitality. The 300-room resort represents a new chapter in Dollywood's evolution as a complete destination experience.</p><h3>Authentic Design and Craftsmanship</h3><p>The resort's design pays homage to traditional Appalachian architecture while incorporating modern luxury amenities. Each room features handcrafted furniture made by local artisans, original artwork celebrating mountain culture, and floor-to-ceiling windows offering spectacular views of the Smoky Mountains. The lobby showcases a stunning three-story stone fireplace and features live music performances every evening.</p><h3>Exclusive Experiences</h3><p>Resort guests enjoy exclusive benefits including early park access, reserved seating at shows, and private dining experiences featuring menus developed in collaboration with renowned Southern chefs. The hotel's signature restaurant, \"Dolly's Table,\" offers a fine dining interpretation of traditional Appalachian cuisine using locally sourced ingredients.</p><h3>Critical Acclaim</h3><p>Travel critics have praised the resort for its authentic atmosphere and attention to detail. The property has already received a four-diamond rating from AAA and has been featured in several national travel publications. Booking rates have exceeded expectations, with the resort maintaining over 90% occupancy since opening.</p>"
}