{
  "id": 53,
  "title": "Dollywood's Harvest Festival Opens September 12 with Record Attendance",
  "author": "Kolby Johnson",
  "date": "September 12, 2025",
  "image": "/images/53.webp",
  "excerpt": "The award-winning Harvest Festival presented by Humana officially opens today, transforming Dollywood with over 12,000 pumpkins and launching the six-week celebration that runs through October 27.",
  "content": "<h3>Festival Gates Open to Autumn Wonderland</h3><p>Dollywood's Harvest Festival presented by Humana officially opened today, September 12, 2025, welcoming guests to the park's transformation into an autumn wonderland in the Great Smoky Mountains. The opening day features the complete festival experience with over 12,000 glowing pumpkins, cascading gourds, and rich Smoky Mountain-inspired décor throughout every corner of Dollywood, creating the comprehensive fall atmosphere that has earned recognition as the country's best fall theme park event.</p><h3>New Candy Corn Country Makes Debut</h3><p>Opening day marks the debut of Candy Corn Country, the new themed area where the Country Fair section has been transformed with sweet new characters and fall surprises. Guests can now experience this fanciful area celebrating the colorful Halloween candy, featuring adorable characters, interactive elements, and photo opportunities in the traditional candy colors of yellow, white, and orange.</p><h3>Full Entertainment Lineup Launches</h3><p>The festival's extensive entertainment programming begins today with Southern gospel, country, and bluegrass performers throughout the park, launching the schedule that will feature more than 700 live performances from over 140 artists across the six-week festival. All concerts are included with park admission, making opening day the start of a music lover's paradise that continues through October 27.</p><h3>Great Pumpkin LumiNights Evening Debut</h3><p>Tonight marks the debut of Great Pumpkin LumiNights for the 2025 season, with the award-winning evening experience illuminating over 12,000 real and faux carved pumpkins throughout the park. The evening transformation includes the towering 40-foot pumpkin tree, enchanting Hoot Owl Hollow, and Dolly's glowing giant guitar, creating the magical nighttime atmosphere that has won the 10Best Reader's Choice Award for Best Theme Park Event.</p><h3>Seasonal Dining and Crafts Available</h3><p>Opening day features the full array of seasonal dining options including Sweet Potato Casserole, Pumpkin Spice Funnel Cake, and a buffet of harvest dishes. Skilled craftspeople offer autumn-scented candles, hand-blown glass ornaments, and other handmade items, while visiting artisans showcase their seasonal creations throughout the park, completing the comprehensive harvest festival experience that continues through the end of October.</p>"
}