{
  "id": 57,
  "title": "Dollywood Unveils NightFlight Expedition: World's First Hybrid Coaster-Rapids Ride Coming 2026",
  "author": "Kolby Johnson",
  "date": "September 17, 2025",
  "image": "/images/57.webp",
  "excerpt": "Dollywood announces its most ambitious project yet with the $50 million NightFlight Expedition, a groundbreaking attraction combining indoor roller coaster elements with whitewater rapids in a single ride experience set to open in Wildwood Grove spring 2026.",
  "content": "<h3>Historic Announcement Marks Dollywood's Largest Investment</h3><p>Dollywood revealed its most expensive attraction in park history on September 17, unveiling the $50 million NightFlight Expedition scheduled to open in spring 2026. The groundbreaking ride, developed in partnership with German manufacturer Mack Rides and Herschend Creative Studios, represents the first attraction in the world to combine an indoor family hybrid roller coaster with a whitewater river raft ride. The announcement event proceeded despite park icon Dolly Parton's absence due to a kidney stone infection, with the country legend sending a heartfelt video message to attendees.</p><h3>Revolutionary Ride Technology Sets Industry Standard</h3><p>The innovative attraction utilizes custom-designed amphibious ride vehicles capable of seamlessly transitioning between coaster track and water, each accommodating 10 passengers with lap-bar restraints. Spanning 1,255 feet of track within a climate-controlled 44,000-square-foot building that rises three stories high, the ride reaches speeds up to 29 miles per hour while navigating over half a million gallons of surging water. Mack Rides, which recently won the 2025 Amusement Today Golden Ticket for Best New Innovation for this ride system, worked for three years developing the technology that enables the unique hybrid experience.</p><h3>Four Distinct Adventures in One Journey</h3><p>The 5.5-minute experience takes riders through four distinct phases: an immersive night flight over the Great Smoky Mountains brought to life with state-of-the-art multimedia projections, a thrilling whitewater rapids adventure, an indoor mountain coaster segment that soars nearly three stories high, and navigation through a mysterious bioluminescent lake. Advanced projection mapping, dynamic lighting effects, and synchronized onboard and offboard audio systems create lifelike environments that immerse riders in atmospheric sounds ranging from rushing rivers to soaring winds.</p><h3>Strategic Expansion Enhances Wildwood Grove</h3><p>Eugene Naughton, President of Dollywood Parks & Resorts, emphasized the attraction's significance, stating that NightFlight Expedition combines cutting-edge technology with immersive storytelling that stays true to the heart of Dollywood and the Smoky Mountains. The ride's location in Wildwood Grove continues the themed area's expansion while telling another Dolly story celebrating the biodiversity of the Great Smoky Mountains at night. With an expected capacity of 1,200 riders per hour and a minimum height requirement of just 39 inches, the attraction ensures accessibility for families with young children.</p><h3>Early Access for Season Passholders</h3><p>Coinciding with the announcement, Dollywood opened 2026 season pass sales on September 17, marking the earliest release in park history. Current passholders will receive exclusive opportunities to experience NightFlight Expedition before its public opening, adding value to the park's loyalty program. The attraction represents a major component of Dollywood's previously announced $500 million expansion plan, setting new standards for guest offerings while reinforcing the park's position among the world's premier theme park destinations.</p>"
}