{
  "id": 58,
  "title": "Dolly Parton Misses Historic Dollywood Announcement Due to Kidney Stone Infection",
  "author": "Kolby Johnson",
  "date": "September 18, 2025",
  "image": "/images/58.webp",
  "excerpt": "Country music legend Dolly Parton was unable to attend Dollywood's NightFlight Expedition announcement in person after developing a kidney stone infection that required medical attention and doctor-ordered rest at home.",
  "content": "<h3>Health Issue Forces Absence from Major Park Event</h3><p>Dolly Parton was unable to attend Dollywood's highly anticipated NightFlight Expedition announcement on September 17, 2025, due to a kidney stone that developed into an infection requiring medical treatment. The 79-year-old country music icon, who had been scheduled to appear at the unveiling of the park's most expensive attraction in history, instead sent a heartfelt video message to attendees explaining her absence and reassuring fans about her recovery progress.</p><h3>Doctor Orders Rest and Recovery Period</h3><p>In her video message to Dollywood guests and media, Parton explained the medical situation with characteristic warmth and humor, stating that she had a kidney stone causing significant problems that subsequently led to an infection. Her doctor specifically advised against traveling, telling her she needed a few days to recover properly before resuming her typically busy schedule. The medical professional's guidance prompted Parton to prioritize her health over the major theme park announcement she had been eagerly anticipating attending.</p><h3>Positive Outlook Despite Medical Setback</h3><p>Despite the disappointment of missing the historic attraction reveal, Parton maintained her characteristic optimism in the video message, reassuring concerned fans by saying they should not worry about her and that she would be okay. She expressed genuine regret about missing the event, emphasizing how much she had been looking forward to being present for the announcement. The country legend assured attendees that while she could not be there physically, she was with them in spirit during the momentous occasion.</p><h3>Challenging Year Requires Resilience</h3><p>The kidney stone incident represents another health challenge during what has already been a difficult year for Parton, following the death of her husband Carl Dean in March 2025 after nearly 60 years of marriage. Despite personal loss and this recent medical issue, the entertainment icon has maintained an extraordinarily busy schedule throughout 2025, including work on her autobiographical Broadway musical, preparation for her first Las Vegas residency in over 30 years scheduled for December, and ongoing oversight of her various business ventures including Dollywood.</p><h3>Swift Recovery Expected for Upcoming Commitments</h3><p>The timing of the kidney stone infection comes as Parton prepares for several major upcoming projects, including her six-show Las Vegas residency titled 'Dolly: Live in Las Vegas' at The Colosseum at Caesars Palace in December. Industry observers expect the brief medical setback will not impact her planned commitments, given her doctor's indication that she needs only a few days of rest to fully recover. The incident underscores the demanding pace Parton maintains at age 79 while managing multiple entertainment ventures and personal responsibilities across her expansive career portfolio.</p>"
}