{
  "id": 60,
  "title": "Media Gets Exclusive Look at NightFlight Expedition Construction Progress",
  "author": "Kolby Johnson",
  "date": "September 19, 2025",
  "image": "/images/60.webp",
  "excerpt": "Dollywood provided media members with an exclusive construction site tour of NightFlight Expedition, revealing the massive scale of the $50 million attraction scheduled to open in spring 2026.",
  "content": "<h3>Massive Construction Site Reveals Attraction Scale</h3><p>Members of the media were granted exclusive access to tour the NightFlight Expedition construction site at Dollywood on September 19, 2025, providing the first close-up look at what will become the park's most expensive single attraction when it opens in spring 2026. The massive 44,000-square-foot building under construction in Wildwood Grove dominated the landscape, with tall concrete footers already rising toward the building's roof structure. The sheer scale of the temperature-controlled facility became apparent during the tour, with the hangar-like structure visible from multiple vantage points throughout the park, including from the Dollywood Express train route.</p><h3>Track and Support Components Arrive on Site</h3><p>Stacks of track pieces and support structures lined the perimeter of the construction zone, with some track sections painted gray and others black, indicating the different themed sections of the 1,255-foot ride path. The Mack Rides components, part of the award-winning ride system that earned the manufacturer the 2025 Amusement Today Golden Ticket for Best New Innovation, were carefully organized around the site. Construction crews have been methodically assembling what will be only the second Mack Rocking Boat attraction in the world and the first to be completely enclosed within a building.</p><h3>Theming and Plaza Development Taking Shape</h3><p>The media tour revealed new details about the attraction's exterior theming, with plans for the building to resemble an airplane hangar fitting the aviation-inspired NightFlight theme. A small pond is being constructed to the right of the show building, while a large plaza will welcome guests at the entrance. The approach path has been designed to pass underneath Big Bear Mountain's finale, creating an integrated experience within the expanded Wildwood Grove area. These elements will support the storyline featuring twin scientists Cora and Jasper Oakley and their search for the mysterious Secret Lake.</p><h3>Four Experiences in One Revolutionary Attraction</h3><p>NightFlight Expedition will combine four distinct experiences into one five-and-a-half-minute journey when it opens. Riders will soar over the Great Smoky Mountains through state-of-the-art multimedia projections, navigate whitewater rapids with more than 500,000 gallons of surging water, climb a mountain ridge on a family-friendly coaster track reaching speeds up to 29 miles per hour, and explore a bioluminescent lake environment. The indoor mountain coaster will rise nearly three stories high, with eleven ride vehicles each seating ten passengers with lap-bar restraints.</p><h3>Spring 2026 Opening Remains on Schedule</h3><p>Construction progress indicates the attraction remains on track for its anticipated spring 2026 opening, likely in April or May. The $50 million investment represents the largest single attraction expenditure in Dollywood Parks & Resorts history, demonstrating the park's commitment to innovation during its 40th anniversary celebration year. Current season passholders who renew will receive exclusive opportunities to experience NightFlight Expedition before it opens to the general public, adding anticipation for what promises to be a groundbreaking addition to the Tennessee theme park's attraction lineup.</p>"
}