{
  "id": 62,
  "title": "Dollywood Parent Company Herschend Closes Two Georgia Family Entertainment Centers Following Palace Acquisition",
  "author": "Kolby Johnson",
  "date": "September 28, 2025",
  "image": "/images/62.webp",
  "excerpt": "Herschend Family Entertainment, owner of Dollywood and Silver Dollar City, permanently closed Malibu Norcross and Mountasia Marietta on September 28, 2025, marking the end of over two decades of operation for both Georgia family entertainment venues.",
  "content": "<h3>Final Day Marks End of Era for Metro Atlanta Entertainment Venues</h3><p>Herschend Family Entertainment, the parent company of Dollywood, permanently closed two Georgia family entertainment centers on September 28, 2025, ending more than 20 years of operation for both facilities. Malibu Norcross in Gwinnett County and Mountasia in Marietta welcomed families for their final day of operations, with Malibu running from noon to 9 p.m. and Mountasia operating from noon to 5 p.m. The popular arcade and go-kart entertainment centers had served as community fixtures where generations of metro Atlanta families created memories racing go-karts, navigating miniature golf courses, splashing through bumper boats, and competing in arcade games throughout their three-decade history in the region.</p><h3>Strategic Realignment Follows Palace Entertainment Acquisition</h3><p>The closures stem from Herschend's acquisition of Palace Entertainment completed in May 2025, which added 20 U.S. parks across 10 states to the company's portfolio of attractions including flagship properties Dollywood and Silver Dollar City. Herschend CEO Andrew Wexler addressed the difficult decision in a statement, acknowledging that these centers have played an important role in their communities while explaining the closures reflect a recognition that Family Entertainment Centers operate differently than the types of attractions the company is best structured to support. The closure announcement came after Herschend had already sold three Palace-acquired properties to Lucky Strike Entertainment, including Raging Waters Los Angeles, Castle Park in Riverside, California, and Wet 'n Wild Emerald Pointe in Greensboro, North Carolina.</p><h3>Community Reflects on Decades of Family Memories</h3><p>Local families spent the final weekend at both locations, sharing nostalgic reflections about the role these entertainment centers played in their lives over multiple generations. Angie Monday, a longtime patron of Mountasia Marietta, brought her son Presley for one last visit, recalling how he learned to drive go-karts at the facility and describing the communal experience of bumper boat rides where staff would get everyone to come together. The entertainment centers had catered primarily to young families and teenagers seeking affordable local entertainment options, featuring attractions that appealed across age groups while providing venues for birthday parties, school celebrations, and casual weekend activities throughout their operational history in the competitive metro Atlanta market.</p><h3>Rapid Portfolio Restructuring Demonstrates Strategic Focus</h3><p>With the sale of three properties and closure of two additional facilities, Herschend had eliminated 20 percent of the parks acquired through the Palace Entertainment transaction within months of completing the deal. The swift restructuring indicates management's commitment to focusing resources on attractions that align with the company's core competencies in operating major theme parks and heritage properties. While the Georgia closures represent the company shedding smaller-format entertainment centers, Dollywood continues operating at full capacity during its 40th anniversary season, with the park recently unveiling the $50 million NightFlight Expedition scheduled to open in spring 2026 as part of a broader $500 million expansion initiative.</p><h3>Industry Observers Note Changing Entertainment Landscape</h3><p>The permanent closures of Malibu Norcross and Mountasia Marietta highlight broader shifts in the family entertainment industry, where traditional arcade and go-kart centers face increasing competition from diverse entertainment options and changing consumer preferences. Herschend's decision to exit the family entertainment center segment allows the company to concentrate investments and operational expertise on larger-scale theme park properties where it has established market leadership. The closures carry no implications for Dollywood's operations in Pigeon Forge, Tennessee, which remains the crown jewel of Herschend's theme park portfolio and continues attracting record attendance while routinely earning recognition as America's best theme park from industry publications and guest satisfaction surveys.</p>"
}