{
  "id": 64,
  "title": "Dolly Parton Reassures Fans with Video Message After Sister's Prayer Request Sparks Health Concerns",
  "author": "Kolby Johnson",
  "date": "October 9, 2025",
  "image": "/images/64.webp",
  "excerpt": "Dollywood icon Dolly Parton posted a reassuring video message on October 8 addressing widespread health concerns triggered by her sister's social media prayer request, confirming she's receiving treatment for kidney stones at Vanderbilt while continuing to work on multiple projects.",
  "content": "<h3>Social Media Prayer Request Triggers Fan Concern</h3><p>Dolly Parton's sister Freida sparked widespread concern across social media on October 8, 2025, when she posted to Facebook requesting prayers for the country music legend, revealing she had been up all night praying for Dolly who hasn't been feeling her best lately. The emotional post asked fans worldwide to serve as prayer warriors, stating that Dolly is strong, loved, and with all the prayers being lifted would be just fine. The request arrived approximately ten days after Parton announced on September 28 that she was postponing her December Las Vegas residency due to health challenges requiring several medical procedures, intensifying speculation about the severity of her condition among the 79-year-old entertainer's devoted fanbase.</p><h3>Video Message Addresses Rumors from Grand Ole Opry Set</h3><p>Hours after her sister's prayer request generated headlines across entertainment media, Parton posted a video to Instagram and other social platforms on October 8 directly addressing health speculation while filming commercials for the Grand Ole Opry. In the two-minute message captioned \"I ain't dead yet,\" Parton appeared in full makeup and glamorous attire while joking with fans about the swirling rumors, asking \"Do I look sick to you?\" The video showed Parton in characteristic good spirits despite acknowledging recent medical challenges, demonstrating her determination to maintain her workload while managing health issues. She emphasized that everyone lately thinks she's sicker than she actually is, using humor and direct communication to calm concerns while providing transparency about her medical situation without revealing excessive personal health details that might worry fans further.</p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/VYQol4eJXqE?si=n9H89-ZGCLa1vkg8\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen style=\"max-width: 100%; margin: 20px 0;\"></iframe><h3>Kidney Stone Treatment at Vanderbilt Medical Center</h3><p>Parton revealed in her video message that she's receiving treatment for kidney stones at Vanderbilt University Medical Center in Nashville, explaining she needed to cancel some commitments to remain closer to home and closer to Vanderbilt where she's having a few treatments here and there. A representative for the entertainer confirmed to media outlets that the situation involves just the kidney stones and the procedure she needs to resolve those, characterizing the medical issue as nothing major. The kidney stone that initially caused problems subsequently led to an infection requiring medical intervention, prompting doctors to advise postponing the Las Vegas residency originally scheduled for December 4-13 at The Colosseum at Caesars Palace, with those performances now rescheduled for September 2026 when recovery will be complete.</p><h3>Health Neglect Following Husband's Death Acknowledged</h3><p>During her candid video message, Parton addressed the root causes of her current health challenges, acknowledging that following her husband Carl Dean's death in March 2025 after nearly 60 years of marriage, she neglected her own medical care during an emotionally difficult period. She admitted that when Carl was very sick and after he passed, she didn't take care of herself, letting things go that she should have been taking care of throughout that traumatic time. The honest reflection demonstrated Parton's characteristic authenticity while explaining how grief and caretaking responsibilities contributed to delayed treatment of developing health issues. Despite these challenges, Parton expressed her determination to continue working, stating emphatically that she's not ready to die yet, doesn't think God is through with her, and she isn't done working on the numerous projects filling her schedule.</h3><h3>Sister Clarifies Post Amid Media Coverage</h3><p>Later on October 8, Freida Parton returned to Facebook to clarify her earlier prayer request after recognizing the alarm it generated among Dolly's millions of fans and across entertainment media outlets. She emphasized that Dolly was simply a little under the weather, apologizing by stating she didn't mean to scare anyone or make it sound so serious when asking for prayers, explaining it was nothing more than a little sister asking for prayers for her sibling. A source close to Parton told ABC News that the entertainer is doing well and continuing to work on multiple projects including preparations for her autobiographical Broadway musical and other entertainment ventures. The incident highlighted both the intense public interest in Parton's wellbeing and the instantaneous spread of health-related information through social media platforms, demonstrating how quickly concern escalates when beloved public figures face medical challenges, particularly for an icon as cherished as Dollywood's namesake founder whose influence extends far beyond the theme park industry into broader American cultural consciousness.</p>"
}