{
  "id": 69,
  "title": "Dollywood Ranks 18th in North America's Most-Visited Theme Parks, Breaking Into Top 20 for First Time with 3.14 Million Guests",
  "author": "Kolby Johnson",
  "date": "October 24, 2025",
  "image": "/images/69.webp",
  "excerpt": "The Themed Entertainment Association's 2024 Global Experience Index released October 23 placed Dollywood at 18th among North American theme parks with 3.14 million visitors, marking the Pigeon Forge park's first appearance in the prestigious top 20 rankings and displacing Six Flags Great Adventure from the list.",
  "content": "<h3>TEA Report Confirms Dollywood's Entry Into Elite Theme Park Rankings</h3><p>The Themed Entertainment Association released its annual attendance report on October 23, 2025, revealing Dollywood cracked the North American top 20 most-visited theme parks for the first time in the organization's reporting history. The Pigeon Forge, Tennessee attraction ranked 18th with an estimated 3.14 million guests during the 2024 calendar year, positioning the Herschend Family Entertainment property between Canada's Wonderland at 17th place and Six Flags Great America at 19th place in the continental rankings. Dollywood's inclusion in the top 20 came at the expense of Six Flags Great Adventure in Jackson, New Jersey, which fell out of the rankings after appearing in previous years' reports, demonstrating shifting attendance patterns among major North American theme park destinations. The TEA's report, now titled the Global Experience Index following a rebranding from its previous \"Theme Index and Museum Index\" designation, represents the definitive study of attendance at the world's top theme parks, water parks, and museums, serving as the industry standard for measuring relative performance among attractions globally. The October 23 release date marked a later-than-typical publication schedule for the annual report, which traditionally appears earlier in the calendar year, with the delay attributed to transitions in research partnerships supporting the data collection and analysis processes underlying the attendance estimates.</p><h3>3.14 Million Visitors Represent Marginal Growth From 2023 Performance</h3><p>Dollywood's 2024 attendance figure of 3.14 million guests represents a modest increase from the 3.12 million visitors reported by TEA for the 2023 calendar year, indicating stable performance during the park's 40th anniversary season while avoiding the dramatic attendance swings experienced by some competitors in the volatile post-pandemic recovery period. The 2024 attendance occurred during a year featuring standard seasonal festival programming including the Festival of Nations spring celebration, Summer Celebration, Harvest Festival presented by Humana running through late October, and Smoky Mountain Christmas extending through early January 2025, without major new ride openings contributing to attendance surges beyond organic growth patterns. Dollywood's internal reporting previously claimed 3.5 million combined guests for Dollywood theme park and Dollywood's Splash Country water park during the 2023 season, though TEA's methodology focuses exclusively on theme park attendance excluding water park figures, accounting for the discrepancy between the park's self-reported numbers and the industry organization's independent estimates. The relatively flat year-over-year attendance demonstrates Dollywood's maturation as a major regional destination maintaining consistent visitation levels rather than experiencing the explosive growth characterizing earlier periods following major attraction investments or the recovery surges some parks experienced immediately following pandemic-related closures and capacity restrictions ending in 2022 and 2023.</p><h3>New Research Partnership Marks Transition From AECOM Collaboration</h3><p>The 2024 Global Experience Index represents the first report produced under the Themed Entertainment Association's new research partnership with Entertainment + Culture Advisors (ECA) and The Park Database (TPDB), replacing the organization's long-standing collaboration with global infrastructure consulting firm AECOM that had supported the annual report for nineteen consecutive years. Entertainment + Culture Advisors operates as a specialized advisory firm focusing on feasibility studies, strategic planning, and market analysis for attractions, entertainment venues, and cultural institutions, while The Park Database maintains comprehensive operational and attendance data for theme parks worldwide through crowdsourced information and industry reporting. The partnership transition prompted the report's rebranding from \"Theme Index and Museum Index\" to \"Global Experience Index,\" reflecting broader coverage beyond traditional theme parks to encompass diverse experience-based attractions including museums, aquariums, and cultural destinations analyzed through similar attendance metrics and market positioning frameworks. TEA, in collaboration with global experience design firm Storyland Studios and editorial partner InPark Magazine, announced the research partnership change during mid-2025, providing the industry with advance notice regarding methodology adjustments and data collection approaches under the new research team's oversight. The 2024 report confirmed global attendance trends showing the combined attendance of the top twenty-five theme parks worldwide grew 2.4 percent to almost 246 million total visitors, demonstrating industry recovery stabilization following the dramatic rebounds and subsequent corrections characterizing 2021 through 2023 as parks emerged from pandemic closures and navigated changing consumer behavior patterns, capacity management strategies, and economic conditions affecting discretionary entertainment spending across international markets.</p><h3>Achievement Validates Dollywood's Position Among Major National Destinations</h3><p>Dollywood's first-time inclusion in TEA's North American top twenty rankings validates the park's evolution from regional Smoky Mountains destination primarily serving Tennessee, North Carolina, Georgia, and surrounding southeastern states to a nationally recognized theme park attracting visitors from across the United States and competing directly with major Six Flags, Cedar Fair, and independent parks for market share and industry recognition. The 18th-place ranking positions Dollywood ahead of established properties including Hersheypark in Pennsylvania, historically one of the country's most popular regional parks, and multiple Six Flags installations that dominated the lower tier of top twenty rankings in previous years' reports before attendance shifts and ownership changes under Six Flags Entertainment Corporation's 2024 merger with Cedar Fair created new competitive dynamics throughout the independent park sector. The achievement arrives as Herschend Family Entertainment, Dollywood's ownership group, completed its acquisition of Palace Entertainment's twenty-four U.S. attractions earlier in 2025, expanding Herschend's portfolio to forty-nine properties with 22,000 employees serving nearly twenty million combined annual guests across its diversified attraction portfolio including Silver Dollar City in Branson, Missouri, and numerous aquariums, dinner theaters, and specialty attractions throughout North America. Dollywood's top twenty breakthrough coincides with the September 2025 announcement of NightFlight Expedition, the park's $50 million investment in the world's first indoor hybrid roller coaster and whitewater raft ride scheduled for spring 2026 opening, demonstrating continued capital allocation toward major attraction development supporting long-term attendance growth objectives and competitive positioning within the increasingly consolidated North American theme park marketplace dominated by Disney, Universal, and the merged Six Flags Cedar Fair entity controlling dozens of parks nationwide.</p>"
}